#pragma once

//オブジェクトネーム------------------------------
enum OBJ_NAME
{
	OBJ_BLOCK,				//ブロック

	//補正
	CORRECTION,				//補正
};
//------------------------------------------------

//当たり判定属性----------------------------------
enum HIT_ELEMENTS
{
	ELEMENT_NULL,//属性無し 全ての属性と当たり判定が実行される
	//以下　同じ属性同士では当たり判定は実行されない
	//属性は追加可能だが、デバック時の色は初期設定分しか無い
	ELEMENT_PLAYER,
	ELEMENT_ENEMY,
	ELEMENT_ITEM,
	ELEMENT_MAGIC,
	ELEMENT_FIELD,
	ELEMENT_RED,
	ELEMENT_GREEN,
	ELEMENT_BLUE,
	ELEMENT_BLACK,
	ELEMENT_WHITE,
};
//------------------------------------------------

//ゲーム内で使用されるグローバル変数・定数・列挙--
#define RANKING_MAX_COUNT (4) // ランキング数+1
#define MAX_CHAR_COUNT (6)	   // 入力できる文字数 
//------------------------------------------------

//セーブ＆ロードとシーン間のやり取りするデータ
struct UserData
{
	int mSeveData;	//サンプルセーブデータ
	int m_point;		//GameMainで得たポイント
	int m_stage_count;//ステージの種類
	int m_ranking[RANKING_MAX_COUNT];//ランキング格納配列
	
};
//------------------------------------------------



//------------------------------------------------
//ゲーム内で使用するクラスヘッダ------------------


//------------------------------------------------

//ゲームシーンオブジェクトヘッダ------------------
#include "ObjBlock.h"			//ブロック

//補助系
#include "Correction.h"			//補正
//------------------------------------------------

//ゲームシーンクラスヘッダ------------------------

//-----------------------------------------------

//シーンスタートクラス---------------------------
//ゲーム開始時のシーンクラス登録
//#define SET_GAME_START  
//-----------------------------------------------